testing/load-tests/tests/games.yaml
config:
  target: https://api.sigma1.games
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    apdex: {}
  apdex:
    threshold: 100
  processor: "./games.ts"
  http:
    defaults:
      headers:
        x-bypass-waf: "SECRET_REMOVED"
        x-bypass-rate-limit: "SECRET_REMOVED"
      cookie:
        session_id: "{{ sessionId }}"

scenarios:
  - flow:
      - function: setSessionId
      - post:
          url: "/access/refresh"
          cookie:
            session_id: "{{ sessionId }}"
      - parallel:
          - get:
              url: "/me/getUser"
          - get:
              url: "/me/getDetailedBalance"
          - get:
              url: "/me/getDetailedProfile"
          - get:
              url: "/chat/getLastMessages"
          - get:
              url: "/affiliate/isConnected"
          - get:
              url: "/notifications/getActual"
      - loop:
          - post:
              url: "/games/playDice"
              json:
                bet: 1000
                sides:
                  - 1
          - think: 800ms
        count: 100