testing/load-tests/tests/games.yaml
config:
  target: http://127.0.0.1:5052
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 15
      name: Ramp up load
    - duration: 30
      arrivalRate: 15
      rampTo: 30
      name: Spike phase
  plugins:
    apdex: {}
  apdex:
    threshold: 400
  http:
    defaults:
      headers:
        Authorization: "Bearer 01947e52-be29-7b2c-a16c-d9e1e1573bf4"

scenarios:
  - flow:
      - loop:
          - get:
              url: "/games/play-dice"
        count: 50